0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          0.01;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    inlet
	{
		type            fixedValue;
		value           uniform $kInlet;
	}
	outlet
	{
		type            zeroGradient;
	}
	top
	{
		type            kqRWallFunction;
		value           uniform $kInlet;  // или uniform 0.01
	}
	bottom
	{
		type            kqRWallFunction;
		value           uniform $kInlet;
	}
	side
    {
        type            empty;
    }
}


// ************************************************************************* //
