0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInlet      10;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInlet;

boundaryField
{
	inlet
	{
		type            fixedValue;
		value           uniform $omegaInlet;
	}
	outlet
	{
		type            zeroGradient;
	}
	top
	{
        type            omegaWallFunction;
        value           uniform $omegaInlet;
    }
	bottom
	{
        type            omegaWallFunction;
        value           uniform $omegaInlet;
    }
	side
    {
        type            empty;
    }

}


// ************************************************************************* //
