system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)        //0
    (2 0 0)        //1
    (2 1 0)        //2
    (0 1 0)        //3
    (8 0 0)        //4
    (8 1 0)        //5
    (2 -1 0)       //6
    (8 -1 0)       //7
    (0 0 0.1)      //8
    (2 0 0.1)      //9
    (2 1 0.1)      //10
    (0 1 0.1)      //11
    (8 0 0.1)      //12
    (8 1 0.1)      //13
    (2 -1 0.1)     //14
    (8 -1 0.1)     //15
);

blocks
(
    hex (0 1 2 3 8 9 10 11) (25 80 1) simpleGrading (1 20 1)
    hex (1 4 5 2 9 12 13 10) (90 80 1) simpleGrading (1 20 1)
    hex (6 7 4 1 14 15 12 9) (90 60 1) simpleGrading (1 0.75 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (8 0 3 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (15 7 4 12)
            (12 4 5 13)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (8 0 1 9)
            (14 6 1 9)
            (14 6 7 15)
        );
    }
    top
    {
        type wall;
        faces
        (
            (11 3 2 10)
            (10 2 5 13)
        );
    }
    side
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (1 4 5 2)
            (6 7 4 1)
            (8 9 10 11)
            (9 12 13 10)
            (14 15 12 9)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
