system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoCentralFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.65;

deltaT          0.00001;

writeControl    adjustable;

writeInterval   0.01;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.3;

maxDeltaT       1;


functions
{
    minPressure
    {
        type            fieldMinMax;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        writeControl    adjustable;
        writeInterval   0.01;
        mode            magnitude;
        fields          ( p );
    }
    minMaxVelocity
    {
        type            fieldMinMax;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        writeControl    adjustable;
        writeInterval   0.01;
        mode            component;
        fields          ( U );
    }

}
// ************************************************************************* //
